atuslhc/band/rockband1/BLE Firmware/Projects/ble/SensorTag/Source/CC2540_bitdef.h
  // P0DIR (0xFD) – Port 0 Direction Control

  // P1DIR (0xFE) – Port 1 Direction Control

  // P2DIR (0xFF) – Port 2 Direction Control

  // P0INP (0x8F) – Port 0 Input Mode

  // P1INP (0xF6) – Port 1 Input Mode

  // P2INP (0xF7) – Port 2 Input Mode

  // PPULL (0xF8) – Port Pullup/Pulldown Control
  #define PPULL_PDUP2L                      0x10          // P2_[2:0] pull direction, when set pulls down
  #define PPULL_PDUP1H                      0x08          // P1_4 pull direction
  #define PPULL_PDUP1L                      0x04          // P1_[3:0] pull direction
  #define PPULL_PDUP0H                      0x02          // P0_[7:4] pull direction
  #define PPULL_PDUP0L                      0x01          // P0_[3:0] pull direction

  // P0IFG (0x89) – Port 0 Interrupt Status Flag

  // P1IFG (0x8A) – Port 1 Interrupt Status Flag
  
  // P2IFG (0x8B) – Port 2 Interrupt Status Flag

  // PICTL (0x8C) - Port Interrupt Control
  #define PICTL_PADSC                       0x40          // Drive strength
  #define PICTL_P2ICONL                     0x10          // P2_[2:0] interrupt on falling edge when set, rising edge when cleared.
  #define PICTL_P1ICONH                     0x08          // P1_4    
  #define PICTL_P1ICONL                     0x04          // P1_[3:0]
  #define PICTL_P0ICONH                     0x02          // P0_[7:4]
  #define PICTL_P0ICONL                     0x01          // P0_[3:0]

  // P0IEN (0xAB) – Port 0 Interrupt Mask

  // P1IEN (0x8D) – Port 1 Interrupt Mask

  // P2IEN (0xAC) – Port 2 Interrupt Mask

  // PMUX (0xAE) – Power-Down Signal Mux
  #define PMUX_CKOEN                        0x80            // Clock out enable, the 32 kHz clock
  #define PMUX_CKOPIN                       (0x07 << 4)     // Selects which pin on Port 0, bit mask
  #define PMUX_DREGSTA                      0x04            // Digital Regulator Status output enable
  #define PMUX_DREGSTAPIN                   (0x07)          // Selects which pin on Port 1, bit mask

  // OBSSEL0 (0x6243) – Observation output control register 0

  // OBSSEL1 (0x6244) – Observation output control register 1

  // OBSSEL2 (0x6245) – Observation output control register 2

  // OBSSEL3 (0x6246) – Observation output control register 3

  // OBSSEL4 (0x6247) – Observation output control register 4

  // OBSSEL5 (0x6248) – Observation output control register 5  


// *************************** CC2544 ********************************
#elif (chip == 2544)  

  // P0 (0x80) – Port 0

  // P1 (0x90) – Port 1

  // P0SEL0 (0xF3) – P0 Function Select
  #define P0SEL0_SELP0_1                  0xF0 
  #define P0SEL0_SELP0_0                  0x0F 

  // P0SEL1 (0xF4) – P0 Function Select
  #define P0SEL1_SELP0_3                  0xF0 
  #define P0SEL1_SELP0_2                  0x0F 

  // P1SEL0 (0xF5) – P1 Function Select
  #define P1SEL0_SELP1_1                  0xF0 
  #define P1SEL0_SELP1_0                  0x0F 

  // P1SEL1 (0xF6) – P1 Function Select
  #define P1SEL1_SELP1_3                  0xF0 
  #define P1SEL1_SELP1_2                  0x0F 

  // PDIR (0xFD) – Port Direction Control
  #define PDIR_DIRP1_3                  0x80 
  #define PDIR_DIRP1_2                  0x40 
  #define PDIR_DIRP1_1                  0x20 
  #define PDIR_DIRP1_0                  0x10 
  #define PDIR_DIRP0_3                  0x08 
  #define PDIR_DIRP0_2                  0x04 
  #define PDIR_DIRP0_1                  0x02 
  #define PDIR_DIRP0_0                  0x01 

  // PINP (0x8F) – Port Input Mode
  #define PINP_MDP1_3                   0x80
  #define PINP_MDP1_2                   0x40
  #define PINP_MDP0_3                   0x08
  #define PINP_MDP0_2                   0x04
  #define PINP_MDP0_1                   0x02
  #define PINP_MDP0_0                   0x01

  // PPULL (0xF7) – Port Pullup/Pulldown Control
  #define PPULL_PDUP1_3                     0x80
  #define PPULL_PDUP1_2                     0x40
  #define PPULL_PADSC                       0x20
  #define PPULL_PDUP0_3                     0x08
  #define PPULL_PDUP0_2                     0x04
  #define PPULL_PDUP0_1                     0x02
  #define PPULL_PDUP0_0                     0x01

  // P0IFG (0x89) – Port 0 Interrupt Status Flag
  
  // P1IFG (0x8A) – Port 1 Interrupt Status Flag

  // P2IFG (0x8B) – USB D+ Interrupt Status Flag

  // PICTL (0x8C) - Port Interrupt Control
  #define PICTL_P1ICON_3                    0x80
  #define PICTL_P1ICON_2                    0x40
  #define PICTL_P1ICON_1                    0x20
  #define PICTL_P1ICON_0                    0x10
  #define PICTL_P0ICON_3                    0x08
  #define PICTL_P0ICON_2                    0x04
  #define PICTL_P0ICON_1                    0x02
  #define PICTL_P0ICON_0                    0x01

  // P0IEN (0xAB) – Port 0 Interrupt mask

  // P1IEN (0x8D) – Port 1 Interrupt mask

  // P2IEN (0xAC) – USB D+ Interrupt mask

  // OBSSEL0 (0x6243) – Observation output control register

  // OBSSEL1 (0x6244) – Observation output control register 1

  // OBSSEL2 (0x6245) – Observation output control register 2

  // OBSSEL3 (0x6246) – Observation output control register

  // OBSSEL4 (0x6247) – Observation output control register

  // OBSSEL5 (0x6248) – Observation output control register 5


// *************************** CC2545 ********************************
#elif (chip == 2545)     

  // P0 (0x80) - Port 0 - bit accessible SFR register

  // P1 (0x90) - Port 1 - bit accessible SFR register 

  // P2 (0xA0) - Port 2 - bit accessible SFR register

  // P3 (0xB0) – Port 3 - bit accessible SFR register

  // PERCFG (0xF1) - Peripheral Control
  #define PERCFG_T1CFG                      0x20
  #define PERCFG_T3CFG                      0x10
  #define PERCFG_T4CFG                      0x08
  #define PERCFG_I2CCFG                     0x04
  #define PERCFG_U0CFG                      (0x03)        // USART0 I/O location bit mask
    #define PERCFG_U0CFG_ALT1                 (0x00)        // Alternative 1 location
    #define PERCFG_U0CFG_ALT2                 (0x01)        // Alternative 2 location
    #define PERCFG_U0CFG_ALT3                 (0x02)        // Alternative 3 location
  
  // APCFG (0xF2) - Analog Peripheral I/O Configuration
  #define APCFG_APCFG7                      0x80        // When set, analog I/O on P0_7 is enabled
  #define APCFG_APCFG6                      0x40
  #define APCFG_APCFG5                      0x20
  #define APCFG_APCFG4                      0x10
  #define APCFG_APCFG3                      0x08
  #define APCFG_APCFG2                      0x04
  #define APCFG_APCFG1                      0x02
  #define APCFG_APCFG0                      0x01

  // P0SEL (0xF3) – P0 Function Select
  #define P0SEL_SELP0_7                     0x80        // Pin function as peripheral I/O when set
  #define P0SEL_SELP0_6                     0x40
  #define P0SEL_SELP0_5                     0x20
  #define P0SEL_SELP0_4                     0x10
  #define P0SEL_SELP0_3                     0x08
  #define P0SEL_SELP0_2                     0x04
  #define P0SEL_SELP0_1                     0x02
  #define P0SEL_SELP0_0                     0x01

  // P1SEL (0xF4) – P1 Function Select
  #define P1SEL_SELP1_6                     0x40        // Pin function as peripheral I/O when set
  #define P1SEL_SELP1_5                     0x20
  #define P1SEL_SELP1_4                     0x10
  #define P1SEL_SELP1_3                     0x08
  #define P1SEL_SELP1_2                     0x04
  #define P1SEL_SELP1_1                     0x02
  #define P1SEL_SELP1_0                     0x01

  // P2SEL (0xF3) – P0 Function Select
  #define P2SEL_SELP2_7                     0x80        // Pin function as peripheral I/O when set
  #define P2SEL_SELP2_6                     0x40
  #define P2SEL_SELP2_5                     0x20
  #define P2SEL_SELP2_4                     0x10
  #define P2SEL_SELP2_3                     0x08
  #define P2SEL_SELP2_2                     0x04
  #define P2SEL_SELP2_1                     0x02
  #define P2SEL_SELP2_0                     0x01
  
  // PPRI (0xFB) - Peripheral Priority Setup
  #define PPRI_OBSLOC                     0x40          // When set OBSSEL at P3[5:0] has priority OBSSEL at P1[5:0]. 
  #define PPRI_PRI0P2                     0x20          // Port 2 peripheral priority control. When set Timer4 has priority over Timer1. 
  #define PPRI_PRI1P1                     0x18          // Port 1 peripheral priority control.
    #define PPRI_PRI1P1_USART               (0x00 << 3)   // USART0 has priority, then Timer3, then I2C.
    #define PPRI_PRI1P1_T3                  (0x01 << 3)   // Timer3 has priority, then USART0, then I2C.
    #define PPRI_PRI1P1_I2C                 (0x10 << 3)   // I2C has priority, then USART0, then Timer3.
  #define PPRI_PRI0P1                     0x04          // Port 1 peripheral priority control. When set Timer4 has priority over Timer1. 
  #define PPRI_PRI0P0                     0x01          // Port 0. When set Timer 1 has priority over USART0

